{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "32"}, {"size": "32"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "4096"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}}}, {"name": "StatefulPartitionedCall/generator/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/dense/BiasAdd", "op": "_FusedMatMul", "input": ["input_1", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/generator/dense/BiasAdd", "StatefulPartitionedCall/generator/batch_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/generator/batch_normalization/batchnorm/mul_1", "StatefulPartitionedCall/generator/batch_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator/batch_normalization/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/generator/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/generator/LeakyRelu", "StatefulPartitionedCall/generator/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator/conv2d_transpose/Shape", "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack", "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack_1", "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator/conv2d_transpose/strided_slice", "StatefulPartitionedCall/generator/conv2d_transpose/stack/1", "StatefulPartitionedCall/generator/conv2d_transpose/stack/2", "StatefulPartitionedCall/generator/conv2d_transpose/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator/conv2d_transpose/stack", "unknown_5", "StatefulPartitionedCall/generator/Reshape"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator/conv2d_transpose/conv2d_transpose", "unknown_6"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator/conv2d_transpose/BiasAdd", "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/LeakyRelu_1", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator/LeakyRelu_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_1/Shape", "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_1/stack", "unknown_11", "StatefulPartitionedCall/generator/LeakyRelu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_1/conv2d_transpose", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_1/BiasAdd", "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/LeakyRelu_2", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/generator/LeakyRelu_2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_2/Shape", "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_2/stack", "unknown_17", "StatefulPartitionedCall/generator/LeakyRelu_2"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_2/conv2d_transpose", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/generator/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/generator/conv2d_transpose_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/generator/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_17", "shape": [4, 4, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17522532682792813, "scale": 0.0013076516927457323, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose_1/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_11", "shape": [4, 4, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15941942293269962, "scale": 0.0012753553834615968, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/generator/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_5", "shape": [4, 4, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09579449585255455, "scale": 0.000912328531929091, "original_dtype": "float32"}}, {"name": "unknown", "shape": [100, 4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08717139599954381, "scale": 0.0006863889448782977, "original_dtype": "float32"}}, {"name": "unknown_0", "shape": [4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0005027626915013089, "scale": 3.4914075798702008e-06, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/batch_normalization/batchnorm/mul", "shape": [4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 3.4985361099243164, "scale": 0.005640959272197648, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/batch_normalization/batchnorm/sub", "shape": [4096], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.0747382220099952, "scale": 0.026736854104434743, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "unknown_6", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00041741743026410836, "scale": 2.6252668570069707e-06, "original_dtype": "float32"}}, {"name": "unknown_12", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0004670659043625289, "scale": 5.8383238045316115e-06, "original_dtype": "float32"}}, {"name": "unknown_18", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04698942695178237, "scale": 0.0002974014364036859, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3180456778582403, "scale": 0.008671353143804213, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3607849180698395, "scale": 0.001466916004816691, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6183776378631592, "scale": 0.0046147584915161135, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/generator/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3918951749801636, "scale": 0.002630121100182627, "original_dtype": "float32"}}]}]}